---
title: Concrete
classe: Autodesk.Revit.DB.Visual.Concrete
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# Concrete

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Concrete.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Concrete.CommonTintToggle` | String |
| `String ConcreteBmMap { get; }` | `Concrete.ConcreteBmMap` | String |
| `String ConcreteBrightmode { get; }` | `Concrete.ConcreteBrightmode` | String |
| `String ConcreteBumpAmount { get; }` | `Concrete.ConcreteBumpAmount` | String |
| `String ConcreteBumpMap { get; }` | `Concrete.ConcreteBumpMap` | String |
| `String ConcreteColor { get; }` | `Concrete.ConcreteColor` | String |
| `String ConcreteFinish { get; }` | `Concrete.ConcreteFinish` | String |
| `String ConcreteSealant { get; }` | `Concrete.ConcreteSealant` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```